# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+title: Differentiable DSP in Faust
#+author: Thomas Rushton

#+startup: overview
#+options: num:t toc:nil reveal_width:1500 reveal_height:1000 ^:{} ':t
#+export_file_name: index

#+REVEAL_ROOT: ../reveal.js
#+REVEAL_THEME: white
#+REVEAL_PLUGINS: (math)
#+REVEAL_MIN_SCALE: 1.0
#+REVEAL_MAX_SCALE: 1.0
#+REVEAL_EXTRA_OPTIONS: hash: true, fragmentInURL: true
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h2>%s</h2><h3>%a</h3>
#+reveal_extra_scripts: ("dist/ifc24.js")
#+reveal_extra_css: style.css

** Running the Presentation

Tangle, =C-c C-v t=, then export as a Reveal.js presentation, =C-c C-e
v v=

#+begin_src emacs-lisp
(setq org-export-before-processing-hook nil)
(add-hook 'org-export-before-processing-functions
	  (lambda (backend)
	    (interactive)
	    (message "building js...")
	    (shell-command "npm run build")))
#+end_src

#+RESULTS:
| lambda | (backend) | (interactive) | (message building js...) | (shell-command-to-string npm run build) |

From the reveal.js directory (=../reveal.js=), run:

#+begin_src shell :noeval :exports code
npm start -- --root=../
#+end_src

Then navigate to [[http://localhost:8000/ifc-2024]].

